## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 6 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                       NAME                                       |
|--------|----------------------------------------------------------------------------------|
| add    | `aws_s3_bucket_object.maintenance_static_page_css_files[&quot;style.css&quot;]`            |
|        | `aws_s3_bucket_object.maintenance_static_page_html_files[&quot;index-fr.html&quot;]`       |
|        | `aws_s3_bucket_object.maintenance_static_page_html_files[&quot;index.html&quot;]`          |
|        | `aws_s3_bucket_object.maintenance_static_page_ico_files[&quot;favicon.ico&quot;]`          |
|        | `aws_s3_bucket_object.maintenance_static_page_svg_files[&quot;site-unavailable.svg&quot;]` |
|        | `aws_s3_bucket_website_configuration.maintenance_mode`                           |
| delete | `aws_s3_bucket_object.maintenance_static_page`                                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_s3_bucket_object.maintenance_static_page will be destroyed
  # (because aws_s3_bucket_object.maintenance_static_page is not in configuration)
  - resource "aws_s3_bucket_object" "maintenance_static_page" {
      - acl                    = "private" -> null
      - bucket                 = "gc-forms-application-maintenance-page" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/html" -> null
      - etag                   = "71d937b0c2975a347679a6b9ea8fa628" -> null
      - force_destroy          = false -> null
      - id                     = "index.html" -> null
      - key                    = "index.html" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./static_website/index.html" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.maintenance_static_page_css_files["style.css"] will be created
  + resource "aws_s3_bucket_object" "maintenance_static_page_css_files" {
      + acl                    = "private"
      + bucket                 = "gc-forms-application-maintenance-page"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css"
      + etag                   = "92fa1c75f720e83330756f94b06aa8bf"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "style.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/style.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.maintenance_static_page_html_files["index-fr.html"] will be created
  + resource "aws_s3_bucket_object" "maintenance_static_page_html_files" {
      + acl                    = "private"
      + bucket                 = "gc-forms-application-maintenance-page"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "5c195ef016b9e898437a543aba2301ac"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index-fr.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/index-fr.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.maintenance_static_page_html_files["index.html"] will be created
  + resource "aws_s3_bucket_object" "maintenance_static_page_html_files" {
      + acl                    = "private"
      + bucket                 = "gc-forms-application-maintenance-page"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "f15e6aa2fd75c9b6b97d93d2b1fedfbd"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.maintenance_static_page_ico_files["favicon.ico"] will be created
  + resource "aws_s3_bucket_object" "maintenance_static_page_ico_files" {
      + acl                    = "private"
      + bucket                 = "gc-forms-application-maintenance-page"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = "58bd7822fbbd5642104beae2b25a1b5b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/favicon.ico"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.maintenance_static_page_svg_files["site-unavailable.svg"] will be created
  + resource "aws_s3_bucket_object" "maintenance_static_page_svg_files" {
      + acl                    = "private"
      + bucket                 = "gc-forms-application-maintenance-page"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "1d263a8e324e88ea09c9b630de277c45"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "site-unavailable.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/site-unavailable.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_website_configuration.maintenance_mode will be created
  + resource "aws_s3_bucket_website_configuration" "maintenance_mode" {
      + bucket           = "gc-forms-application-maintenance-page"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

Plan: 6 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.firehose_waf_logs,
  on kinesis.tf line 30, in resource "aws_s3_bucket" "firehose_waf_logs":
  30: resource "aws_s3_bucket" "firehose_waf_logs" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.maintenance_static_page_css_files[\"style.css\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.maintenance_static_page_html_files[\"index-fr.html\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.maintenance_static_page_html_files[\"index.html\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.maintenance_static_page_ico_files[\"favicon.ico\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.maintenance_static_page_svg_files[\"site-unavailable.svg\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.forms_base_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.valid_app_uri_paths"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
